sources/Documents/ФормированиеНагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ФормированиеНагрузки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокУчетаЧасов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Нагрузка1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЛек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЛаб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовКонс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЭкз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Нагрузка2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЛек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЛаб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовКонс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовЭкз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

sources/Catalogs/ИндивидуальныеНастройкиГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИндивидуальныеНастройкиГрупп</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаMoodle</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОблако</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПреподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойПреподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВСтатистику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/Documents/ФормированиеНагрузки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СуммированиеПоСтрокам(ТекДанные)

	ТекДанные.ВсегоЧасов = ТекДанные.ВсегоЧасовЛек + ТекДанные.ВсегоЧасовЛаб + ТекДанные.ВсегоЧасовКурс + ТекДанные.ВсегоЧасовКонс + ТекДанные.ВсегоЧасовЭкз; 
КонецПроцедуры


&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЛекПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЛабПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовКурсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовКонсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка1ВсегоЧасовЭкзПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка1.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЛекПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЛабПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовКурсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовКонсПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура Нагрузка2ВсегоЧасовЭкзПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка2.ТекущиеДанные;
	СуммированиеПоСтрокам(ТекДанные);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьИндивидуальныеНастройкиНаСервере(Ссылка)
	
	МассивДляДобавления = ОбщиеФункции.ПолучитьВсеУникальныеПарыГруппыПредметыИзНагрузки(Ссылка);
	КолвоДоб = 0;
	КолвоИм = 0;
	
	Для каждого Добавление Из МассивДляДобавления Цикл
		
		Попытка
		
			Запись = Справочники.ИндивидуальныеНастройкиГрупп.СоздатьЭлемент();
		 	Запись.Наименование =  Строка(Добавление.Группа) + " " + Строка(ОбщиеФункции.ПолучитьШифрНаСервере(Добавление.Предмет));
			Запись.Группа = Добавление.Группа;
		 	Запись.Предмет = Добавление.Предмет;
			Запись.ВыводитьВСтатистику = Истина;
		 	Запись.Записать();
		    КолвоДоб = КолвоДоб + 1;
			
		Исключение
		   КолвоИм = КолвоИм + 1;
		КонецПопытки;
		 
	
	КонецЦикла;
	
	Сообщить("Внесено " + КолвоДоб + " настроек, " + КолвоИм + " настроек уже имелось");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИндивидуальныеНастройки(Команда)
	
	Если Модифицированность = Ложь И Объект.Проведен = Истина Тогда
	
		 СформироватьИндивидуальныеНастройкиНаСервере(Объект.Ссылка);
	
	КонецЕсли;
	
	
КонецПроцедуры
